import Image from "next/image";
import modelImg from "@/assets/imagecut.png";
import { IoCheckmark } from "react-icons/io5";

const OurPackage = () => {
  return (
    <div className="bg-white md:py-[100px] py-16">
     
         <div className="max-w-[1290px] mx-auto px-4 md:px-6 lg:px-4 2xl:px-0">
         <h1 className="text-center text-primaryColor md:text-[56px] text-[30px] font-Noto-Sans-Bengali font-bold">  আমাদের সহজলভ্য প্যাকেজ সমূহ</h1>
         <div className=" w-[100%] lg:flex gap-6 md:mt-[60px] mt-10">
           
        <div className="lg:w-[50%] w-full lg:max-h-[564.323px] h-full">
          <Image
            className="w-full h-auto object-contain rounded-md"
            src={modelImg}
            alt="modal image"
          />
        </div>

        <div className="lg:w-[50%] w-full h-full md:flex md:gap-[30px] mt-[30px] lg:mt-0">
          {/* card 1 */}
          <div className="w-full border-[1.5px] border-primaryBorder p-5 rounded-md">
             
          <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32" fill="none">
  <path d="M14.8431 13.1251C18.7374 13.0341 22.2782 12.5288 25.1632 10.2352C28.0211 7.77076 26.0764 4.81819 23.043 3.56512C20.3404 2.37121 18.0458 2.06115 14.8431 2C-1.75536 2.51759 0.278489 13.1152 14.8431 13.1251ZM14.8431 4.32008C18.5181 4.32008 21.2931 5.71507 21.2931 7.56007C21.202 11.8548 8.48641 11.8563 8.3981 7.55999C8.39807 5.71507 11.1681 4.32008 14.8431 4.32008Z" fill="#F00C89"/>
  <path d="M14.8434 9.80007C18.0534 9.80007 20.2934 8.62007 20.2934 7.56007C20.2934 6.50007 18.0534 5.32007 14.8434 5.32007C11.6334 5.32007 9.39844 6.50007 9.39844 7.56007C9.39844 8.62007 11.6334 9.80007 14.8434 9.80007Z" fill="#F00C89"/>
  <path d="M6.76606 19.4152C7.44107 19.7163 8.1381 19.9653 8.85106 20.1602C8.85103 19.4839 8.85106 16.8407 8.85106 16.1152C8.85341 15.9841 8.90712 15.8592 9.00064 15.7674C9.09415 15.6755 9.21999 15.6241 9.35107 15.6241C9.48215 15.6241 9.60799 15.6755 9.7015 15.7674C9.79501 15.8593 9.84872 15.9842 9.85106 16.1152C9.85099 16.8512 9.85111 19.7234 9.85106 20.4052C10.5829 20.109 11.2817 19.7369 11.9361 19.2952V16.6452C11.9361 16.5126 11.9887 16.3854 12.0825 16.2917C12.1763 16.1979 12.3035 16.1452 12.4361 16.1452C12.5687 16.1452 12.6958 16.1979 12.7896 16.2917C12.8834 16.3854 12.9361 16.5126 12.9361 16.6452V18.6102C15.6461 16.7202 17.8111 15.0802 19.4411 13.7152C14.6552 14.7698 6.96422 13.7803 4.12112 11.185C3.75285 10.8942 3.41751 10.564 3.12109 10.2002V15.3652C3.15232 16.7386 4.09874 17.9344 5.76609 18.9052V14.8502C5.76609 14.7176 5.81877 14.5904 5.91254 14.4966C6.00631 14.4029 6.13349 14.3502 6.26609 14.3502C6.3987 14.3502 6.52588 14.4029 6.61965 14.4966C6.71342 14.5904 6.76609 14.7176 6.76609 14.8502C6.76602 15.6388 6.76609 18.6857 6.76606 19.4152Z" fill="#F00C89"/>
  <path d="M9.5321 22.1101C8.72843 22.7177 7.43479 23.0965 7.4021 24.2801C7.39031 24.5315 7.43965 24.782 7.54589 25.0102C7.65213 25.2383 7.8121 25.4373 8.0121 25.5901L13.3121 29.6751C13.5862 29.884 13.9208 29.998 14.2654 29.9998C14.61 30.0016 14.9459 29.8912 15.2221 29.6851C15.8221 29.2301 16.4021 28.7818 16.9621 28.3401C16.7834 28.1876 9.71764 22.2673 9.5321 22.1101Z" fill="#F00C89"/>
  <path d="M23.8565 17.8451C24.4017 18.3701 25.1882 19.1243 25.7365 19.6501C28.9011 15.1944 29.977 11.2994 27.5516 7.36011C27.6231 10.5872 24.3237 12.319 21.5566 13.1952C19.2893 15.2964 15.4046 18.1579 11.9365 20.5051C11.4215 20.847 10.9108 21.1964 10.3965 21.5351C10.5672 21.6756 17.359 27.3711 17.7565 27.7001C18.5965 27.0151 19.3865 26.3401 20.1265 25.6751C19.7742 25.3197 17.8415 23.3902 17.8415 23.3902C17.7952 23.3439 17.7584 23.289 17.7333 23.2285C17.7082 23.168 17.6953 23.1031 17.6953 23.0377C17.6953 22.9722 17.7082 22.9073 17.7333 22.8468C17.7584 22.7864 17.7952 22.7314 17.8415 22.6852C17.9359 22.5915 18.0635 22.5389 18.1965 22.5389C18.3295 22.5389 18.4571 22.5915 18.5515 22.6852C18.9471 23.074 20.8665 25.0002 20.8665 25.0002C21.5765 24.3402 22.2398 23.6885 22.8565 23.0452C22.4677 22.7296 20.4765 21.1202 20.4765 21.1202C20.4251 21.079 20.3823 21.028 20.3506 20.9702C20.319 20.9124 20.299 20.8489 20.292 20.7834C20.285 20.7179 20.291 20.6516 20.3098 20.5885C20.3285 20.5253 20.3595 20.4664 20.4011 20.4153C20.4426 20.3641 20.4939 20.3217 20.552 20.2905C20.61 20.2593 20.6736 20.2399 20.7392 20.2333C20.8048 20.2268 20.871 20.2333 20.934 20.2525C20.9971 20.2717 21.0557 20.3032 21.1065 20.3452C21.1065 20.3452 23.1596 22 23.5465 22.3152C24.1215 21.6852 24.6482 21.0652 25.1265 20.4552C24.7627 20.1095 23.1665 18.5702 23.1665 18.5702C23.0727 18.4781 23.0188 18.3529 23.0166 18.2215C23.0143 18.0901 23.0639 17.9631 23.1545 17.8679C23.2451 17.7727 23.3695 17.7169 23.5008 17.7127C23.6322 17.7084 23.7599 17.756 23.8565 17.8451Z" fill="#F00C89"/>
            </svg>
           
            <h1 className="text-primaryColor text-[20px] font-Noto-Sans-Bengali font-bold mt-5">
              ফ্রি ট্রায়াল
            </h1>

            <p className="text-switchColor text-[16px] font-Noto-Sans-Bengali font-normal leading-6">
              যারা ভালো কিছু করতে চান তাদের জন্য
            </p>

            <h4 className="text-primaryColor text-[28px] mt-5 font-Noto-Sans-Bengali font-normal">
              ৳0
            </h4>

            <h2 className="text-secondaryColor text-[28px] font-Poppins font-semibold">
              5-10 অর্ডার
            </h2>

            <button className="mt-[30px] w-full bg-secondaryColor py-[14px] text-[20px] text-white font-Noto-Sans-Bengali font-medium leading-7 rounded-md">
              বিনামূল্যে শুরু করুন
            </button>

            <div className="flex flex-col gap-[10px] mt-[30px]">
              <div className="flex items-center gap-1">
                <IoCheckmark className="size-6 text-secondaryColor" />
                <p className="text-primaryColor text-[18px] font-Poppins font-normal">
                  50টি অর্ডার ক্রিয়েশন
                </p>
              </div>

              <div className="flex items-center gap-1">
                <IoCheckmark className="size-6 text-secondaryColor" />
                <p className="text-primaryColor text-[18px] font-Poppins font-normal">
                  কাস্টমার ম্যানেজমেন্ট
                </p>
              </div>

              <div className="flex items-center gap-1">
                <IoCheckmark className="size-6 text-secondaryColor" />
                <p className="text-primaryColor text-[18px] font-Poppins font-normal">
                  গ্রুপ অর্ডারস
                </p>
              </div>

              <div className="flex items-center gap-1">
                <IoCheckmark className="size-6 text-secondaryColor" />
                <p className="text-primaryColor text-[18px] font-Poppins font-normal">
                  অ্যাডভান্সড ম্যানেজমেন্ট
                </p>
              </div>

              <div className="flex items-center gap-1">
                <IoCheckmark className="size-6 text-secondaryColor" />
                <p className="text-primaryColor text-[18px] font-Poppins font-normal">
                  প্রায়োরিটি সাপোর্ট
                </p>
              </div>
            </div>
          </div>



         {/* card 2 */}
          <div className="w-full border-[1.5px] border-primaryBorder p-5 rounded-md mt-[24px] md:mt-0">
            
          <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32" fill="none">
  <path d="M28.3492 26.2546L26.8492 23.6546C26.385 22.8507 25.6206 22.2642 24.724 22.024C23.8273 21.7837 22.872 21.9095 22.0682 22.3736L21.6352 22.6236L21.1352 21.7561L18.5352 23.2561L22.2852 29.7531C22.7526 30.5504 23.5164 31.1305 24.4099 31.3667C25.3035 31.603 26.2542 31.4762 27.0546 31.0141C27.855 30.5519 28.4401 29.792 28.6823 28.9C28.9244 28.0081 28.804 27.0566 28.3472 26.2531L28.3492 26.2546ZM26.0682 29.3046C25.8975 29.4032 25.709 29.4672 25.5136 29.4929C25.3181 29.5186 25.1195 29.5056 24.9292 29.4545C24.7388 29.4034 24.5603 29.3153 24.404 29.1952C24.2477 29.0751 24.1166 28.9254 24.0182 28.7546L22.5182 26.1546C22.4197 25.9839 22.3558 25.7954 22.3301 25.6C22.3044 25.4046 22.3175 25.2061 22.3686 25.0157C22.4197 24.8253 22.5077 24.6469 22.6278 24.4906C22.7478 24.3342 22.8974 24.2031 23.0682 24.1046C23.2389 24.0061 23.4273 23.9422 23.6227 23.9165C23.8182 23.8909 24.0167 23.904 24.2071 23.955C24.3974 24.0061 24.5759 24.0942 24.7322 24.2142C24.8885 24.3342 25.0197 24.4839 25.1182 24.6546L26.6182 27.2546C26.7165 27.4254 26.7802 27.6139 26.8057 27.8093C26.8311 28.0048 26.8178 28.2033 26.7665 28.3936C26.7152 28.5839 26.6269 28.7622 26.5066 28.9183C26.3864 29.0745 26.2365 29.2054 26.0657 29.3036L26.0682 29.3046Z" fill="#F00C89"/>
  <path d="M12.8254 16.368L15.4254 11.868L9.00095 0.745045C8.95859 0.671122 8.89803 0.609252 8.82504 0.565304C8.75205 0.521356 8.66904 0.496788 8.58389 0.493933C8.49874 0.491078 8.41427 0.51003 8.3385 0.54899C8.26273 0.58795 8.19817 0.645626 8.15095 0.716545C7.44737 1.76605 7.05199 2.99173 7.00966 4.25455C6.96732 5.51737 7.27973 6.76677 7.91145 7.86104L12.8254 16.368Z" fill="#F00C89"/>
  <path d="M19.1755 18.3679L17.863 20.6409C17.5906 21.1084 17.2512 21.5334 16.8555 21.9024C17.2521 22.1101 17.6769 22.2588 18.1165 22.3439L20.6325 20.8914L19.1755 18.3679Z" fill="#F00C89"/>
  <path d="M24.0867 7.86104C24.7188 6.767 25.0316 5.51772 24.9897 4.25491C24.9478 2.99209 24.5529 1.76629 23.8497 0.716545C23.8025 0.645626 23.7379 0.58795 23.6621 0.54899C23.5864 0.51003 23.5019 0.491078 23.4167 0.493933C23.3316 0.496788 23.2486 0.521356 23.1756 0.565304C23.1026 0.609252 23.0421 0.671122 22.9997 0.745045L11.3672 20.8915L13.8832 22.344C14.5301 22.2223 15.1431 21.9625 15.6804 21.5823C16.2177 21.2022 16.6667 20.7105 16.9967 20.141L24.0867 7.86104ZM15.9997 18.322C15.9008 18.322 15.8041 18.2927 15.7219 18.2378C15.6397 18.1828 15.5756 18.1047 15.5377 18.0134C15.4999 17.922 15.49 17.8215 15.5093 17.7245C15.5286 17.6275 15.5762 17.5384 15.6461 17.4685C15.7161 17.3986 15.8052 17.3509 15.9021 17.3317C15.9991 17.3124 16.0997 17.3223 16.191 17.3601C16.2824 17.3979 16.3605 17.462 16.4154 17.5443C16.4704 17.6265 16.4997 17.7232 16.4997 17.822C16.4997 17.9547 16.447 18.0818 16.3532 18.1756C16.2595 18.2694 16.1323 18.322 15.9997 18.322Z" fill="#F00C89"/>
  <path d="M10.3665 22.625L9.93348 22.375C9.12961 21.9109 8.17429 21.7852 7.27769 22.0254C6.38108 22.2656 5.61663 22.8522 5.15248 23.656L3.65248 26.256C3.41904 26.6542 3.26667 27.0947 3.20414 27.552C3.14161 28.0093 3.17016 28.4745 3.28814 28.9207C3.40612 29.367 3.6112 29.7855 3.89158 30.1522C4.17196 30.5188 4.5221 30.8264 4.92184 31.0572C5.32157 31.288 5.76301 31.4374 6.22074 31.4969C6.67847 31.5564 7.14345 31.5248 7.58891 31.4039C8.03436 31.2829 8.4515 31.0751 8.81629 30.7923C9.18109 30.5095 9.48635 30.1573 9.71448 29.756L13.4645 23.259L10.8645 21.759L10.3665 22.625ZM9.48248 26.156L7.98248 28.756C7.88399 28.9268 7.75284 29.0764 7.59651 29.1964C7.44019 29.3165 7.26175 29.4045 7.07139 29.4556C6.88103 29.5067 6.68248 29.5198 6.48706 29.4941C6.29165 29.4684 6.1032 29.4045 5.93248 29.306C5.76177 29.2075 5.61212 29.0764 5.49209 28.9201C5.37205 28.7637 5.28399 28.5853 5.23291 28.3949C5.18184 28.2046 5.16876 28.006 5.19443 27.8106C5.22009 27.6152 5.28399 27.4268 5.38248 27.256L6.88248 24.656C7.0814 24.3113 7.40913 24.0596 7.79358 23.9565C8.17802 23.8533 8.5877 23.9071 8.93248 24.106C9.27727 24.3049 9.52891 24.6327 9.63205 25.0171C9.7352 25.4016 9.6814 25.8113 9.48248 26.156Z" fill="#F00C89"/>
          </svg>
           
            <h1 className="text-primaryColor text-[20px] font-Noto-Sans-Bengali font-bold mt-5">
            সিলভার
            </h1>

            <p className="text-switchColor text-[16px] font-Noto-Sans-Bengali font-normal leading-6">
              যারা ভালো কিছু করতে চান তাদের জন্য
            </p>

            <h4 className="text-primaryColor text-[28px] mt-5 font-Noto-Sans-Bengali font-normal">
            ৳120
            </h4>

            <h2 className="text-secondaryColor text-[28px] font-Poppins font-semibold">
            50-100 অর্ডার
            </h2>

            <button className="mt-[30px] w-full bg-secondaryColor py-[14px] text-[20px] text-white font-Noto-Sans-Bengali font-medium leading-7 rounded-md">
            এখন কিনুন
            </button>

            <div className="flex flex-col gap-[10px] mt-[30px]">
              <div className="flex items-center gap-1">
                <IoCheckmark className="size-6 text-secondaryColor" />
                <p className="text-primaryColor text-[18px] font-Poppins font-normal">
                  50টি অর্ডার ক্রিয়েশন
                </p>
              </div>

              <div className="flex items-center gap-1">
                <IoCheckmark className="size-6 text-secondaryColor" />
                <p className="text-primaryColor text-[18px] font-Poppins font-normal">
                  কাস্টমার ম্যানেজমেন্ট
                </p>
              </div>

              <div className="flex items-center gap-1">
                <IoCheckmark className="size-6 text-secondaryColor" />
                <p className="text-primaryColor text-[18px] font-Poppins font-normal">
                  গ্রুপ অর্ডারস
                </p>
              </div>

              <div className="flex items-center gap-1">
                <IoCheckmark className="size-6 text-secondaryColor" />
                <p className="text-primaryColor text-[18px] font-Poppins font-normal">
                  অ্যাডভান্সড ম্যানেজমেন্ট
                </p>
              </div>

              <div className="flex items-center gap-1">
                <IoCheckmark className="size-6 text-secondaryColor" />
                <p className="text-primaryColor text-[18px] font-Poppins font-normal">
                  প্রায়োরিটি সাপোর্ট
                </p>
              </div>
            </div>
          </div>







        </div>
      </div>
         </div>
    </div>
  );
};

export default OurPackage;
